Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
void GetTypeSpecificServerOperations(
	ExternalResourceServerExtensions extensions
)
  Visual Basic
Sub GetTypeSpecificServerOperations ( _
	extensions As ExternalResourceServerExtensions _
)
  Visual C++
void GetTypeSpecificServerOperations(
	ExternalResourceServerExtensions^ extensions
)
 Parameters
  extensions
 Type:  Autodesk.Revit.DB ExternalResourceServerExtensions
 See Also
  IExternalResourceServer Interface
  Autodesk.Revit.DB Namespace